Revit 2027 API
StairsSupportTopsideSurfaceType Enumeration
 The style of the topside surface of the support.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum StairsSupportTopsideSurfaceType
Public Enumeration StairsSupportTopsideSurfaceType
public enum class StairsSupportTopsideSurfaceType
type StairsSupportTopsideSurfaceType
Members
Member name | Value | Description
Closed | 0 |  The style of the topside surface of the support is closed.
Open | 1 |  The style of the topside surface of the support is open.
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace